import {toContentDetails} from "../../util/ContentUtil";
import {V2022_1} from "./toc/java/V2022_1";

export const P24 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2022-02-03",
    "17:30",
    "20:00",
  ],
  [ // 3 React
    "2022-02-08",
    "17:30",
    "20:00",
  ],
  [ // 4 选课系统前端部分1（Lab）
    "2022-02-10",
    "17:30",
    "20:30",
  ],
  [ // 5 制作COVID case map (Lab)
    "2022-02-15",
    "17:30",
    "20:30",
  ],
  [ // 6 - Spring Boot
    "2022-02-17",
    "17:30",
    "20:00",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2022-02-22",
    "17:30",
    "20:30",
  ],
  [ // 8 - MySQL与Hibernate
    "2022-02-24",
    "17:30",
    "20:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2022-03-01",
    "17:30",
    "20:30",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2022-03-03",
    "17:30",
    "20:30",
  ],
  [ // 11 - 选课系统云部署1 (Lab)
    "2022-03-08",
    "17:30",
    "20:30",
  ],
  [ // 12 - 系统设计以及优化
    "2022-03-10",
    "17:30",
    "20:00",
  ],
], V2022_1);