import {toContentDetails} from "../../util/ContentUtil";
import {V2022_1} from "./toc/java/V2022_1";

export const P26 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2022-03-29",
    "18:30",
    "21:00",
  ],
  [ // 3 React
    "2022-03-31",
    "18:00",
    "20:30",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2022-04-03",
    "15:00",
    "18:00",
  ],
  [ // 5 制作COVID case map (Lab)
    "2022-04-07",
    "18:00",
    "21:00",
  ],
  [ // 6 - Spring Boot
    "2022-04-10",
    "15:00",
    "18:00",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2022-04-14",
    "18:00",
    "21:00",
  ],
  [ // 8 - MySQL与Hibernate
    "2022-04-17",
    "15:00",
    "18:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2022-04-21",
    "18:00",
    "21:00",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2022-04-24",
    "15:00",
    "18:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2022-04-28",
    "18:00",
    "19:30",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2022-05-01",
    "15:00",
    "16:30",
  ],
  [ // 12 - 系统设计以及优化
    "2022-05-05",
    "18:00",
    "20:30",
  ],
], V2022_1);