import {toContentDetails} from "../../util/ContentUtil";
import {V2022_2} from "./toc/java/V2022_2";

export const P28 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2022-05-19",
    "18:30",
    "20:00",
  ],
  [ // 3 React
    "2022-05-24",
    "17:30",
    "20:00",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2022-05-26",
    "17:30",
    "20:30",
  ],
  [ // 5 制作COVID case map (Lab)
    "2022-05-31",
    "17:30",
    "21:00",
  ],
  [ // 6 - Spring Boot
    "2022-06-02",
    "17:30",
    "20:30",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2022-06-07",
    "17:30",
    "20:30",
  ],
  [ // 8 - MySQL与Hibernate
    "2022-06-09",
    "17:30",
    "20:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2022-06-14",
    "17:30",
    "20:30",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2022-06-21",
    "17:30",
    "21:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2022-06-23",
    "17:30",
    "19:00",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2022-06-28",
    "17:30",
    "18:30",
  ],
  [ // 12 - node理论+实践
    "2022-06-30",
    "17:30",
    "20:30",
  ],
  [ // 13 - 系统设计以及优化
    "2022-07-05",
    "17:30",
    "20:00",
  ],
], V2022_2);