import {toContentDetails} from "../../util/ContentUtil";
import {V2022_2} from "./toc/java/V2022_2";

export const P29 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2022-07-06",
    "17:30",
    "20:00",
  ],
  [ // 3 React
    "2022-07-11",
    "17:30",
    "20:00",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2022-07-13",
    "17:30",
    "20:30",
  ],
  [ // 5 制作COVID case map (Lab)
    "2022-07-15",
    "17:30",
    "21:00",
  ],
  [ // 6 - Spring Boot
    "2022-07-18",
    "17:30",
    "20:30",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2022-07-20",
    "17:30",
    "20:30",
  ],
  [ // 8 - MySQL与Hibernate
    "2022-07-22",
    "17:30",
    "20:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2022-07-25",
    "17:30",
    "20:30",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2022-07-27",
    "17:30",
    "21:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2022-07-29",
    "17:30",
    "19:00",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2022-08-01",
    "17:30",
    "18:30",
  ],
  [ // 12 - node理论+实践
    "2022-08-03",
    "17:30",
    "20:30",
  ],
  [ // 13 - 系统设计以及优化
    "2022-08-05",
    "17:30",
    "20:00",
  ],
], V2022_2);