import {toContentDetails} from "../../util/ContentUtil";
import {V2022_2} from "./toc/java/V2022_2";

export const P31 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2022-07-26",
    "17:00",
    "19:30",
  ],
  [ // 3 React
    "2022-07-28",
    "17:00",
    "19:30",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2022-07-31",
    "16:00",
    "19:00",
  ],
  [ // 5 制作COVID case map (Lab)
    "2022-08-02",
    "17:00",
    "20:00",
  ],
  [ // 6 - Spring Boot
    "2022-08-04",
    "17:00",
    "19:30",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2022-08-07",
    "16:00",
    "19:00",
  ],
  [ // 8 - MySQL与Hibernate
    "2022-08-09",
    "17:00",
    "19:30",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2022-08-11",
    "17:00",
    "19:30",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2022-08-14",
    "16:00",
    "19:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2022-08-16",
    "17:00",
    "20:00",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2022-08-18",
    "17:00",
    "18:00",
  ],
  [ // 12 - node理论+实践
    "2022-08-21",
    "16:00",
    "19:00",
  ],
  [ // 13 - 系统设计以及优化
    "2022-08-23",
    "17:00",
    "19:30",
  ],
], V2022_2);