import {toContentDetails} from "../../util/ContentUtil";
import {V2022_2} from "./toc/java/V2022_2";

export const P33 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2023-02-01",
    "20:30",
    "23:30",
  ],
  [ // 3 React
    "2023-02-06",
    "19:00",
    "22:00",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2023-02-10",
    "19:00",
    "22:00",
  ],
  [ // 5 制作COVID case map (Lab)
    "2023-02-13",
    "19:00",
    "22:00",
  ],
  [ // 6 - Spring Boot
    "2023-02-17",
    "19:00",
    "22:00",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2023-02-20",
    "19:00",
    "22:00",
  ],
  [ // 8 - MySQL与Hibernate
    "2023-02-24",
    "19:00",
    "22:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2023-02-27",
    "19:00",
    "22:00",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2023-03-03",
    "19:00",
    "22:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2023-03-06",
    "19:00",
    "22:00",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2023-03-10",
    "19:00",
    "20:00",
  ],
  [ // 12 - node理论+实践
    "2023-03-13",
    "19:00",
    "22:00",
  ],
  [ // 13 - 系统设计以及优化
    "2023-03-17",
    "19:00",
    "22:00",
  ],
], V2022_2);