import {toContentDetails} from "../../util/ContentUtil";
import {V2022_2} from "./toc/java/V2022_2";

export const P33 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2023-04-22",
    "09:00",
    "11:00",
  ],
  [ // 3 React
    "2023-04-29",
    "09:00",
    "11:00",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2023-05-03",
    "18:00",
    "21:00",
  ],
  [ // 5 制作COVID case map (Lab)
    "2023-05-06",
    "09:00",
    "12:00",
  ],
  [ // 6 - Spring Boot
    "2023-05-10",
    "18:00",
    "20:00",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2023-05-13",
    "09:00",
    "12:00",
  ],
  [ // 8 - MySQL与Hibernate
    "2023-05-17",
    "18:00",
    "20:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2023-05-20",
    "09:00",
    "12:00",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2023-05-24",
    "18:00",
    "21:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2023-05-27",
    "09:00",
    "12:00",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2023-05-28",
    "09:00",
    "10:00",
  ],
  [ // 12 - node理论+实践
    "2023-05-31",
    "18:00",
    "20:00",
  ],
  [ // 13 - 系统设计以及优化
    "2023-06-03",
    "09:00",
    "11:00",
  ],
], V2022_2);