import {toContentDetails} from "../../util/ContentUtil";
import {V2022_2} from "./toc/java/V2022_2";

export const P35 = toContentDetails([
  [ // 2 JS基础以及HTML, CSS
    "2023-07-17",
    "18:00",
    "20:00",
  ],
  [ // 3 React
    "2023-07-20",
    "18:00",
    "20:00",
  ],
  [ // 4 选课系统前端部分1（Lab)
    "2023-07-24",
    "18:00",
    "20:00",
  ],
  [ // 5 制作COVID case map (Lab)
    "2023-07-27",
    "18:00",
    "20:00",
  ],
  [ // 6 - Spring Boot
    "2023-07-31",
    "18:00",
    "20:00",
  ],
  [ // 7 - 选课系统后端部分1 (Lab)
    "2023-08-03",
    "18:00",
    "20:00",
  ],
  [ // 8 - MySQL与Hibernate
    "2023-08-07",
    "18:00",
    "20:00",
  ],
  [ // 9 - 选课系统后端部分2 (Lab)
    "2023-08-10",
    "18:00",
    "20:00",
  ],
  [ // 10 - 选课系统前端部分2 (Lab)
    "2023-08-14",
    "18:00",
    "20:00",
  ],
  [ // 11-a - 选课系统云部署 (理论部分 + 录屏)
    "2023-08-17",
    "18:00",
    "20:00",
  ],
  [ // 11-b - 选课系统云部署 (Q & A)
    "2023-08-21",
    "18:00",
    "20:00",
  ],
  [ // 12 - node理论+实践
    "2023-08-24",
    "18:00",
    "20:00",
  ],
  [ // 13 - 系统设计以及优化
    "2023-08-28",
    "18:00",
    "20:00",
  ],
], V2022_2);